In [4]:
# defining pd series
import pandas as pd

new_series = pd.Series([1,2,3])

print(new_series)

new_dataframe = pd.DataFrame({
    'Name':['Ujjwal','Ram'],
    'Age': [21,20],
    'Marks': [99,100]
})

new_dataframe

0    1
1    2
2    3
dtype: int64

     Name  Age  Marks
0  Ujjwal   21     99
1     Ram   20    100

In [ ]:
# reading and saving files

student_csv_file = pd.read_csv('Data/student.csv')
# student_csv_file.to_csv('Data/new_student.csv')

student_csv_file.head()
student_csv_file.tail()
student_csv_file.describe()

              id       mark
count  35.000000  29.000000
mean   18.000000  73.827586
std    10.246951  17.056773
min     1.000000  18.000000
25%     9.500000  60.000000
50%    18.000000  78.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [22]:
from IPython.display import display

print(student_csv_file['name'].head()) # gives output in series
# display(student_csv_file[['name','mark']].head()) # gives output in dataframe. Use list as argu. for multiple columns

# Slicing rows

# display(student_csv_file[:3].head())

# loc and iloc

# display(student_csv_file.loc[3,'name'])
# display(student_csv_file.loc[3,'name':'mark'])
# display(student_csv_file.loc[3,['name','mark']])
display(student_csv_file.iloc[3,[1,2]])

display(student_csv_file.iat[2,1])

0      John Deo
1      Max Ruin
2        Arnold
3    Krish Star
4     John Mike
Name: name, dtype: object

name     Krish Star
class          Four
Name: 3, dtype: object

'Arnold'

In [ ]:
# filtering:

# display(student_csv_file.mark>50)

# filtered_data = student_csv_file[student_csv_file.gender == 'female']
# display(filtered_data.tail())

# student_csv_file[(student_csv_file.mark>50) & (student_csv_file.gender == 'male')]

# str, contains, isin, between, startswith

starts_with_u = student_csv_file[student_csv_file.name.str.startswith('J')]

starts_with_u.head()

contains_john = student_csv_file[student_csv_file.name.str.contains('John')]
contains_john

between_mark_50_and_90 = student_csv_file[student_csv_file.mark.between(50,85)]
between_mark_50_and_90

    id         name  class  mark  gender
1    2     Max Ruin  Three  85.0    male
2    3       Arnold  Three  55.0    male
3    4   Krish Star   Four  60.0     NaN
4    5    John Mike   Four  60.0     NaN
5    6    Alex John   Four  55.0    male
6    7  My John Rob  Fifth  78.0    male
7    8       Asruid   Five  85.0    male
8    9      Tes Qry    Six  78.0    male
9   10     Big John   Four  55.0     NaN
17  18        Honny   Five  75.0    male
19  20       Jackly   Nine  65.0  female
20  21   Babby John   Four  69.0  female
21  22       Reggid  Seven  55.0  female
23  24    Tiddy Now  Seven  78.0    male
25  26       Crelea  Seven  79.0    male
26  27     Big Nose  Three  81.0  female
28  29  Tess Played  Seven  55.0    male
29  30    Reppy Red    Six  79.0  female
33  34     Gain Toe  Seven  69.0    male

In [46]:
# nlargest and nsmallest plus tilt(~)

top_two_students = student_csv_file.nlargest(2,'mark')
display(top_two_students)

low_two_students = student_csv_file.nsmallest(2,'mark')
low_two_students

mark_range_50_to_85 = student_csv_file[student_csv_file.isin(student_csv_file.mark.between(50,85))]
mark_range_50_to_85

    id       name class  mark  gender
32  33  Kenn Rein   Six  96.0  female
11  12      Recky   Six  94.0  female

    id name class  mark gender
0  NaN  NaN   NaN   NaN    NaN
1  NaN  NaN   NaN   NaN    NaN
2  NaN  NaN   NaN   NaN    NaN
3  NaN  NaN   NaN   NaN    NaN
4  NaN  NaN   NaN   NaN    NaN
5  NaN  NaN   NaN   NaN    NaN
6  NaN  NaN   NaN   NaN    NaN
7  NaN  NaN   NaN   NaN    NaN
8  NaN  NaN   NaN   NaN    NaN
9  NaN  NaN   NaN   NaN    NaN
10 NaN  NaN   NaN   NaN    NaN
11 NaN  NaN   NaN   NaN    NaN
12 NaN  NaN   NaN   NaN    NaN
13 NaN  NaN   NaN   NaN    NaN
14 NaN  NaN   NaN   NaN    NaN
15 NaN  NaN   NaN   NaN    NaN
16 NaN  NaN   NaN   NaN    NaN
17 NaN  NaN   NaN   NaN    NaN
18 NaN  NaN   NaN   NaN    NaN
19 NaN  NaN   NaN   NaN    NaN
20 NaN  NaN   NaN   NaN    NaN
21 NaN  NaN   NaN   NaN    NaN
22 NaN  NaN   NaN   NaN    NaN
23 NaN  NaN   NaN   NaN    NaN
24 NaN  NaN   NaN   NaN    NaN
25 NaN  NaN   NaN   NaN    NaN
26 NaN  NaN   NaN   NaN    NaN
27 NaN  NaN   NaN   NaN    NaN
28 NaN  NaN   NaN   NaN    NaN
29 NaN  NaN   NaN   NaN    NaN
30 NaN  NaN   NaN   NaN    NaN
31 NaN  NaN   NaN   NaN    NaN
32 NaN  NaN   NaN   NaN    NaN
33 NaN  NaN   NaN   NaN    NaN
34 NaN  NaN   NaN   NaN    NaN

In [60]:
# apply, map, replace, astype, pipe

student_csv_file['divided_mark'] = student_csv_file['mark'].apply(lambda m: m / 50)
student_csv_file

student_csv_file['mapped'] = student_csv_file['gender'].map({'female':'f', 'male':'m'})
student_csv_file

student_csv_file['type_changed'] = student_csv_file['mark'].astype(float)
student_csv_file

def marks_div_50(df):

    return df['mark']/50

student_csv_file['pipe_applied'] = student_csv_file.pipe(marks_div_50)
student_csv_file

,id,name,class,mark,gender,divided_mark,mapped,type_changed,pipe_applied
0,1,John Deo,Four,NaN,female,NaN,f,NaN,NaN
1,2,Max Ruin,Three,85.0,male,1.70,m,85.0,1.70
2,3,Arnold,Three,55.0,male,1.10,m,55.0,1.10
3,4,Krish Star,Four,60.0,NaN,1.20,NaN,60.0,1.20
4,5,John Mike,Four,60.0,NaN,1.20,NaN,60.0,1.20
5,6,Alex John,Four,55.0,male,1.10,m,55.0,1.10
6,7,My John Rob,Fifth,78.0,male,1.56,m,78.0,1.56
7,8,Asruid,Five,85.0,male,1.70,m,85.0,1.70
8,9,Tes Qry,Six,78.0,male,1.56,m,78.0,1.56
9,10,Big John,Four,55.0,NaN,1.10,NaN,55.0,1.10
10,11,Ronald,Six,89.0,female,1.78,f,89.0,1.78
11,12,Recky,Six,94.0,female,1.88,f,94.0,1.88
12,13,Kty,Seven,NaN,female,NaN,f,NaN,NaN
13,14,Bigy,Seven,NaN,female,NaN,f,NaN,NaN
14,15,Tade Row,Four,88.0,male,1.76,m,88.0,1.76
15,16,Gimmy,Four,88.0,male,1.76,m,88.0,1.76
16,17,Tumyu,Six,NaN,male,NaN,m,NaN,NaN
17,18,Honny,Five,75.0,male,1.50,m,75.0,1.50
18,19,Tinny,Nine,18.0,male,0.36,m,18.0,0.36
19,20,Jackly,Nine,65.0,female,1.30,f,65.0,1.30
20,21,Babby John,Four,69.0,female,1.38,f,69.0,1.38
21,22,Reggid,Seven,55.0,female,1.10,f,55.0,1.10
22,23,Herod,Eight,NaN,male,NaN,m,NaN,NaN
23,24,Tiddy Now,Seven,78.0,male,1.56,m,78.0,1.56
24,25,Giff Tow,Seven,88.0,male,1.76,m,88.0,1.76
25,26,Crelea,Seven,79.0,male,1.58,m,79.0,1.58
26,27,Big Nose,Three,81.0,female,1.62,f,81.0,1.62
27,28,Rojj Base,Seven,86.0,female,1.72,f,86.0,1.72
28,29,Tess Played,Seven,55.0,male,1.10,m,55.0,1.10
29,30,Reppy Red,Six,79.0,female,1.58,f,79.0,1.58
30,31,Marry Toeey,Four,NaN,male,NaN,m,NaN,NaN
31,32,Binn Rott,Seven,90.0,female,1.80,f,90.0,1.80
32,33,Kenn Rein,Six,96.0,female,1.92,f,96.0,1.92
33,34,Gain Toe,Seven,69.0,male,1.38,m,69.0,1.38
34,35,Rows Noump,Six,88.0,female,1.76,f,88.0,1.76

In [64]:
# groupby

grouped_by_gender = student_csv_file.groupby('gender')
grouped_by_gender